package com.edu.basic.dao;

import java.util.List;

import com.edu.basic.dto.BookTypeDTO;

//-----------------------------------------------------------------------------------------------------------
// public interface BookTypeDAO
//-----------------------------------------------------------------------------------------------------------
public interface BookTypeDAO {

	//-----------------------------------------------------------------------------------------------------------
	// 도서 종류 데이터 목록 가져오기
	//-----------------------------------------------------------------------------------------------------------
	public List<BookTypeDTO> selectBookType() throws Exception;
	
} // End - public interface BookTypeDAO
